tutorials/impHybridPorousInterFoam/liquid-drainage/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    nhat            leastSquares;
}

divSchemes
{
    div(rhoPhiByEps,U)  Gauss vanLeerV;  
    div(phi,alpha)   Gauss vanLeer;  
    div(phirb,alpha) Gauss interfaceCompression; 
    div(((rho*nu)*dev2(T(grad(U))))) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    Fluid_c2f  harmonic;
}

snGradSchemes
{
    default         corrected; 
}

fluxRequired
{
    pc;
}


// ************************************************************************* //
