tutorials/impHybridPorousInterFoam/liquid-drainage/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(

);

regions
(
    boxToCell
    {
        box (-0.00046 -2e-3 -1e-3) (-0.00039 2e-3 1e-3);  //460um

        fieldValues
        (
            volScalarFieldValue alpha.wetting 1.0
        );
    }
);


// ************************************************************************* //
